// 7.0 = 0b111.0
//所以，E=2, e=E+bias=2+(2^7-1)=129(这里的^是次方)
// M=1+f=0b1.11, f=0b0.11,
// V=(-1)^0*(0b1.11*2^2),
// 7.0 = 0b0 10...01(k位指数) 110...0(n位小数)

// 以32位的float举例
// f共有23位，而奇数的二进制表示末尾必须为1
// 所以当E=23，时，小数点右移23位。此时为最大的奇数
// f=0b0.1...1, M=0b1.1...1, E=23, e=23+127=150, s=0
// maxodd=0b0 1001 0110 1111 1111 1111 1111 1111 111

// e=1,E=1-bias, f=0, V=2^(1-bias),原数e1
// 倒数：E=-(1-bias)=bias-1, V=2^(bias-1), e=E+bias=2*bias-1,设倒数为e2
// 例如：8位指数位，bias=2^7-1=127=0111 1111, e1=00000001, e2=1111 1101

